In [14]:
import pandas as pd
data1=pd.read_csv(r'../result/baseline_offline.csv')
data2=pd.read_csv(r'../result/baseline_offline_2.csv')
# data2=pd.read_csv(r'../result/baseline.csv')

In [15]:
data1.head()

   RECRUIT_ID  PERSON_ID  LABEL
0      786572    5943277      1
1      798205    5566970      1
2      781074    6094326      1
3      764027    5991347      1
4      772135    5566970      1

In [16]:
data2.head()

   RECRUIT_ID  PERSON_ID  LABEL
0    42828653  317512979      1
1    43993651     377663      1
2    43993651  321007946      1
3    43993651  320690941      1
4    43993651  320847903      1

In [17]:
data=pd.merge(data1,data2,on=["RECRUIT_ID","PERSON_ID"])

In [18]:
data#.LABEL_x#==data.LABEL_y

      RECRUIT_ID  PERSON_ID  LABEL_x  LABEL_y
0         786572    5943277        1        0
1         798205    5566970        1        0
2         781074    6094326        1        0
3         764027    5991347        1        0
4         772135    5566970        1        0
...          ...        ...      ...      ...
7054      766615    5519340        0        0
7055      772901    5777586        0        0
7056      772907    5909765        0        0
7057      772907    5663974        0        0
7058      815822    6264226        0        0

[7059 rows x 4 columns]

In [19]:
data.LABEL_y.value_counts()

0    6000
1    1059
Name: LABEL_y, dtype: int64

In [20]:
data.LABEL_x.value_counts()

0    6000
1    1059
Name: LABEL_x, dtype: int64

In [22]:
sum(data.LABEL_x==data.LABEL_y)

5427